1. Import pandas and read the data into a DataFrame. Print the first 5 rows of the DataFrame.

In [8]:
import pandas as pd

In [13]:
dataframe=pd.read_csv('pandas_question.csv')

In [15]:
dataframe

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

In [16]:
dataframe.head(5)

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York


2. Print the number of rows and columns in the DataFrame.

In [17]:
dataframe.shape

(10, 6)

3. Print the null value count

In [18]:
dataframe.isnull().sum()

Name           0
Gender         0
Age            0
Height (cm)    0
Weight (kg)    0
City           0
dtype: int64

4. Print the average age, height, and weight of the people in the DataFrame.

In [19]:
dataframe.describe()

             Age  Height (cm)  Weight (kg)
count  10.000000    10.000000    10.000000
mean   31.600000   175.000000    68.900000
std     6.552353     7.133645    10.246409
min    25.000000   165.000000    55.000000
25%    27.250000   170.500000    60.750000
50%    29.000000   175.000000    67.500000
75%    34.250000   178.750000    77.250000
max    45.000000   190.000000    85.000000

In [20]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         10 non-null     object
 1   Gender       10 non-null     object
 2   Age          10 non-null     int64
 3   Height (cm)  10 non-null     int64
 4   Weight (kg)  10 non-null     int64
 5   City         10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [21]:
dataframe[['Age','Height (cm)','Weight (kg)']].mean()

Age             31.6
Height (cm)    175.0
Weight (kg)     68.9
dtype: float64

5. Print the name and city of the person who is the tallest in the DataFrame.

In [22]:
dataframe.max()

Name               Jack
Gender             Male
Age                  45
Height (cm)         190
Weight (kg)          85
City           New York
dtype: object

6. Create a new column in the DataFrame called "BMI" that calculates the body mass index of each person. BMI is calculated as weight (kg) divided by height (m) squared. Print the DataFrame with the new column.

In [23]:
dataframe= dataframe.rename(columns={'Height (cm)': 'Height', 'Weight (kg)': 'Weight'})

In [24]:
BMI= dataframe['Weight'] / (dataframe['Height']/100**2)
print(BMI)

0    3515.151515
1    4444.444444
2    4000.000000
3    3823.529412
4    3428.571429
5    4473.684211
6    3273.809524
7    4285.714286
8    3662.790698
9    4333.333333
dtype: float64

In [25]:
dataframe['BMI']= BMI
print(dataframe)

      Name  Gender  Age  Height  Weight         City          BMI
0    Alice  Female   25     165      58     New York  3515.151515
1      Bob    Male   30     180      80  Los Angeles  4444.444444
2  Charlie    Male   35     175      70      Chicago  4000.000000
3    Diana  Female   28     170      65        Miami  3823.529412
4      Eva  Female   27     175      60     New York  3428.571429
5    Frank    Male   40     190      85      Houston  4473.684211
6    Grace  Female   32     168      55      Chicago  3273.809524
7    Henry    Male   45     175      75  Los Angeles  4285.714286
8      Ivy  Female   26     172      63        Miami  3662.790698
9     Jack    Male   28     180      78     New York  4333.333333

7. Group the data by gender and print the average age, height, and weight of males and females separately.

In [26]:
dataframe.groupby(by='Gender').size()

Gender
Female    5
Male      5
dtype: int64

In [27]:
gender_age=dataframe.groupby(by='Gender')['Age'].mean()
gender_height=dataframe.groupby(by='Gender')['Height'].mean()
gender_weight=dataframe.groupby(by='Gender')['Weight'].mean()
print(gender_age,gender_height,gender_weight)

Gender
Female    27.6
Male      35.6
Name: Age, dtype: float64 Gender
Female    170.0
Male      180.0
Name: Height, dtype: float64 Gender
Female    60.2
Male      77.6
Name: Weight, dtype: float64

8. Sort the data by age in ascending order and print the first 3 rows of the sorted DataFrame.

In [28]:
h= dataframe.sort_values(by=['Age'])
h.head(3)

    Name  Gender  Age  Height  Weight      City          BMI
0  Alice  Female   25     165      58  New York  3515.151515
8    Ivy  Female   26     172      63     Miami  3662.790698
4    Eva  Female   27     175      60  New York  3428.571429

9. Filter the data to only include people who live in New York and print the resulting DataFrame.

In [29]:
dataframe[(dataframe.City=='New York')]

    Name  Gender  Age  Height  Weight      City          BMI
0  Alice  Female   25     165      58  New York  3515.151515
4    Eva  Female   27     175      60  New York  3428.571429
9   Jack    Male   28     180      78  New York  4333.333333